var i = 0, k = -1, l = 0;
let text = ["萤，我来京城找你了。这一次，我绝对不会再错过……",
    "……但是京城这么大，如果还是按照小城的那种方法去找的话，估计黄花菜都凉了。 ",
    "那这段时间里有什么少见的情况吗……",
    "……少见？",
    "！！",
    "对了，我记得前几天在来京城的路上的时候，看到了许多会使用“气”的道士武夫都是朝着京城来的……",
    "记得青月跟我说过，好像是武林大会的日子到了，似乎今年的冠军奖品是罕见的天外陨石。",
    "假如说那个天外陨石就是“工蜂”的话，那么萤肯定是比我先到京城，看来我的下一步已经很明确了",
    "就是去调查清楚武林大会的具体时间和地点后，先去周围找一下是否有萤的踪迹，",
    "如果没有，就只能在武林大会上露个面了……。",
    "一天后",
    "终于打听到了武林大会的时间了，几个门派的年轻人都说是明天，看来应该错不了了。",
    "张言泽站在客栈窗边，突然看到了一个跟他穿着类似的女人正小心翼翼地沿着街边穿过——刘雯！",
    "说时迟那时快，张言泽立马转身飞奔出了客栈，循着刚刚留下的踪迹追寻着刘雯的脚步。",
    "在穿过大街来到附近一条靠里的巷子，终于在前面看到了女子的身影……",
    "萤……刘雯，是你吗？",
    "只见前面的女孩突然身子一颤，急剧回头……",
    "是你吗，影？想不到总部竟然派你来找我。",
    "不知道想到什么，刘雯突然带着少有的羞涩淡淡地笑了起来。",
    "是我，我……我，我来找你来了。",
    "这里不宜展开讲，跟我走吧，我在这附近的客栈有一间房，我们到那里再讨论一下各自的情报。",
    "……",
    "到了客栈后，花了将近半天的时间。张言泽和刘雯才基本上是分享完双方的情报。",
    "所以说，武林大会的奖品是飞船，你想要夺回飞船？",
    "我知道我的想法很……奇怪，我想拿回飞船，是因为飞船上有我父亲唯一留下来的一串项链。",
    "本来我也不知道怎么去拿回，我的绝大部分的设备都留在了飞船上，现在你来了，你把你的外骨骼借给我，我亲自去参战，绝不连累你。",
    "如果，如果说……到时候不小心被留在那了，你就跟总部汇报我已经阵亡的消息吧……",
    "我去吧。",
    "张言泽冷不丁地说了这么一句话，刘雯似乎还没有反应过来，随后连忙拒绝：",
    "这怎么行，这纯粹是我的私事，你没必要因为我再受到连累的。你能来京城找我，我，我就已经很满足了……",
    "刘雯的声音越说越小。",
    "不用再说了，我都找到这了，打架这种事情还是交给我来做吧，你就到时候等着收礼就行了……",
    "……而且，那毕竟是你父亲留给你的礼物。",
    "突然想到自己，发现家庭便因为一场突如其来的灾难，竟是不曾给自己留下任何痕迹，因此他知道这份情感归宿的珍贵。",
    "刘雯见拗不过张言泽，便开心地点了点头：",
    "我相信你，等你的好消息。"];

let charName = ["张言泽",
    "张言泽",
    "张言泽",
    "张言泽",
    "张言泽",
    "张言泽",
    "张言泽",
    "张言泽",
    "张言泽",
    "张言泽",
    "",
    "张言泽",
    "张言泽",
    "",
    "",
    "张言泽",
    "",
    "刘雯",
    "",
    "张言泽",
    "张言泽",
    "",
    "",
    "张言泽",
    "刘雯",
    "刘雯",
    "刘雯",
    "张言泽",
    "",
    "",
    "",
    "张言泽",
    "张言泽",
    "",
    "",
    ""];


function nextText() {
    if (l < 36) {
        k++;
        i = 0;
    }
    else {
        return;
    }
    typingEffect();
    typingName();
}

function typingEffect() {

    if (i < text[k].length) {
        document.getElementById('duihua').innerHTML += text[k].charAt(i);
        i++;
        setTimeout(typingEffect, 50);


    }

}



function typingName() {
    document.getElementById('mingzi').innerHTML = charName[k];

}


function remove() {
    document.getElementById('duihua').innerHTML = "";
    document.getElementById('mingzi').innerHTML = "";
    nextText();
}

function nextDialogue() {
    addEventListener('click', remove);
  
}

nextDialogue();