var i = 0, k = -1, l = 0;
let text = ["第五天 中午",
    "老板，跟你打听个事，这张照片上的人，你有没用瞧见过没",
    "你这画像，竟能如此逼真？",
    "这可是海外来的东西，你们这些一辈子没看过海的人当然没见过，老板，有印象吗",
    "这件衣服倒是眼熟。离家到这儿来摆摊，我每次都要路过药店。一个月前路过时刚好就看见穿这件衣服的人从药店出来。",
    "老板，瓜的银子，收好了",
    "这...这太多了我找不开啊",
    "不用找了，你给我指个路就行",
    "直走在左转，街道上立着药局的就是了，不过你得小心点，今天早上一直下雨，街道泥泞，我走过的时候裤脚车轮都脏了。",
    "不过现在雨停了，路面也不会太糟糕。",
    "我进入药店，狭窄的屋子里此刻却挤满了人。众人的目光聚焦于两个瘦小的小孩（A，B）",
    "大家快来看啊，这家药店太黑心了，卖的药材都是烂货。今天早上我的弟弟来你们药店看病，回家煎药喝下去之后却一直昏迷不醒。",
    "不可能，老师不会开错药给人，我们的药材也都是山上采摘的。",
    "大家看，我手上拿着的是药师开的药方，大家请看……",
    "沉默",
    "众人互相传阅药方，张言泽夹在在人群中拿到药方，利用高科技进行分析",
    "你说你怎么赔我，我的弟弟喝了你们的药，现在一直发高烧昏迷不醒。要么就陪我10万两黄金，要么，就赔我免费治好我的弟弟！",
    "徒弟面露苦色，毕竟十万两可不是他能拿得出手的，相比之下，治好这个小孩可能难度会小一些……",
    "好吧，我去请师傅治好你弟弟的病。",
    "等等，你在撒谎。",
    "大家看他们的鞋子。你的鞋子明显是脏的，但你昏迷着的弟弟鞋子却很洁净。",
    "今天早上一直下雨，路过这条街道裤子鞋子一定会被弄脏，你说你的弟弟早上来看病，但他的鞋子却是洁净干燥的，这说明他根本没来过，一直待在房子里。",
    "是...是我记错了，我弟弟是...昨天来看病的，对，他是昨天来看病的，就是喝了你们店里的药才出事的。药方就是证据",
    "这张药方不是这里开的，很明显，字迹是仿写的",
    "你胡说，这药方是真的",
    "虽然字迹一模一样，但这张药方却没有中药味道，在中药店里药方一般都会有中药味，这张却没有，所以，你在撒谎！",
    "（慌张）...",
    "发生什么事了，怎么这么热闹啊",
    "师父，您探病回来了啊",
    "（说明了来龙去脉）",
    "药方呢，让我看看……",
    "药师看完药方。",
    "这药方，是我前几周为贾家林小姐开的产前护理方啊，我就算在怎么糊涂，也不会给男性开产前护理的药吧，",
    "瑟瑟发抖，一言不发",
    "小兄弟，谢谢你了，要不是你，我们药店今天就要丢面子了。",
    "（看向A）至于你，背你弟弟进来吧，我为他治病……",
    "（过了不一会儿，那位瘦弱的哥哥便背着弟弟走出了药馆）",
    "小兄弟，你还呆在这里，是有什么病症吗，别的不行，老朽治病行医还是在行的",
    "实不相瞒，我是来找人的。不知药师是否认识照片上的女子",
    "…嗯，我是见过她",
    "那你能告诉我她现在在哪里吗？",
    "一个月前，她血痕累累的倒在药店的门口，我便收留了她。",
    "伤好之后，她便走了，不过留下了这件物什儿（一个便携式消息投影装置），让我之后交给来找她的人。",
    "多谢药师，感谢药师救治了我的战友……"];

let charName = ["",
    "张言泽",
    "瓜老板",
    "张言泽",
    "瓜老板",
    "张言泽",
    "瓜老板",
    "张言泽",
    "瓜老板",
    "瓜老板",
    "",
    "A",
    "徒弟",
    "A",
    "",
    "",
    "A",
    "",
    "徒弟",
    "张言泽",
    "张言泽",
    "张言泽",
    "A",
    "张言泽",
    "A",
    "张言泽",
    "A",
    "药师",
    "徒弟",
    "徒弟",
    "药师",
    "",
    "药师",
    "A",
    "药师",
    "",
    "",
    "药师",
    "张言泽",
    "药师",
    "张言泽",
    "药师",
    "药师",
    "张言泽"];


function nextText() {
    if (l < 44) {
        k++;
        i = 0;
    }
    else {
        return;
    }
    typingEffect();
    typingName();
}

function typingEffect() {

    if (i < text[k].length) {
        document.getElementById('duihua').innerHTML += text[k].charAt(i);
        i++;
        setTimeout(typingEffect, 50);


    }

}



function typingName() {
    document.getElementById('mingzi').innerHTML = charName[k];

}


function remove() {
    document.getElementById('duihua').innerHTML = "";
    document.getElementById('mingzi').innerHTML = "";
    nextText();
}

function nextDialogue() {
    addEventListener('click', remove);

}

nextDialogue();