var i = 0, k = -1, l = 0;
let text = ["刘雯留下的机器的信息投影出来，得知她去往了京城。",
    "临走前药师还赠与了张言泽一些银子，张言泽便拿出一部分租了一辆马车…… ",
    "砰！（射击游戏，参考古早游戏，《打地鼠》）",
    "砰！",
    "砰！",
    "黑屏",
    "（敌袭？大意了！）",
    "张言泽倒在地上，白衣黑发的女子持剑架在张泽言脖子上，远处的背景是倒地的马车",
    "这就是所谓的仙人吗，也太变态了吧",
    "忏悔吧。",
    "我忏悔...",
    "个屁啊，出手伤人，还说着莫名其妙的话。你谁啊？",
    "这位道友，吾名青月。东海蓬莱人，平生最爱野游。",
    "路过此地，听闻此山有盗贼山匪，驾黑色马车拦路行凶，便想着替天行道。没成想误会了道友，还望海涵。",
    "道长心善，可是我着急赶路，你如今毁我马车，此事你打算如何解决？",
    "不知道友去往何方？",
    "京城",
    "京城 京城 此事好办。正巧我也要去京城，我载你一程便是",
    "道长莫开玩笑，荒郊野岭，前不着村后不着店，如今马车已坏，良马已丢，你要怎么载我去京城？靠你背着的剑吗？",
    "别急",
    "柳青月拿出一张黄符，低声念咒。地上碎石抖动，聚集，密麻麻的石拼成一只马。",
    "接着如蛇版的青藤从树林钻出，爬上马车顶替破损的部位。",
    "jiangjiang，马车修好了，道友，走吧",
    "两人重新上路",
    "道长，虽然你已经帮我把马车修好了，也没必要陪着我一起去京城。",
    "这些造物如果离我太远，就会死去生气变成死物，无妨，反正我突然也想去京城了",
    "那就劳烦道长了",
    "归根结底，还是我的错，自然会承担起这次责任的",
    "...",
    "夕阳西下",
    "还有一天就能到京城了，现在天色已晚，前面有个村子，我们就去借宿一宿吧",
    "好",
    "二位道长，我是此地的村长，请问来我们吴村是？",
    "村长，我们想借宿一晚，不知可否",
    "简单，简单。不过道长，老汉我有一事相求",
    "但讲无妨。",
    "二位一路奔波，想必也已经累了，我们先去吃饭，剩下的再说……",
    "道长，是这样的，我们村的教书先生老去了，今晚刚好是下葬的日子，如果可以的话，希望道长能帮忙度化。",
    "小事，小事。度化诵经，我最拿手了",
    "...",
    "怎么了言泽，心不在焉的，还在回味吃席吗，也确实，做完法事吃大餐，舒心",
    "青月，为什么人死之后，要埋进土里呢？明明已经死了，失去了价值，为什么大家又要聚在一起怀念呢？",
    "如果他们真的因为人的死亡而怀念，为什么又能非常平静的吃丰盛的宴席呢？",
    "你这……外星人吧，怎么会有这种想法呢，一个人生前已经足够累了，何必还要在他死后去讨论是否具有价值呢？",
    "大家聚在一起怀念，是因为相信啊，逝去的亲人并没有完全离开我们，而是就在遥远的天上看着，我们开心了，操了一辈子心的他们，也能稍微放心了……",
    "嘿，话说，为什么你要急着去京城呢？黄帝老头邀你当官了？",
    "我在寻人。",
    "寻人？妻子跑啦？",
    "酒可以多喝，话可不能乱讲啊。是一个……战友。",
    "战友？那就是青梅咯，要我说啊，青梅哪比得过半生初遇之人",
    "你怎么一喝了酒嘴上就没个把门的。",
    "你这人还真无趣的很。算了吧，明日天一亮我们就启程去京城吧。",
    "次日启程。",
    "临近京城。",
    "嗯？你不是也要进城吗？",
    "害，那都是骗你的，我就是好心肠护你一程，这路上艰险得很，不护着你，能不能到京城都不一定。",
    "好了，现在你到了京城，生命应该无忧，我也要继续游侠四方了。我们，有缘再会！",
    "张言泽听到这段话，突然懂得了什么叫做侠客之行。"];

let charName = ["",
    "",
    "",
    "",
    "",
    "",
    "张言泽",
    "",
    "张言泽",
    "仙人",
    "张言泽",
    "张言泽",
    "柳青月",
    "柳青月",
    "张言泽",
    "柳青月",
    "张言泽",
    "柳青月",
    "张言泽",
    "柳青月",
    "",
    "",
    "柳青月",
    "",
    "张言泽",
    "柳青月",
    "张言泽",
    "柳青月",
    "",
    "",
    "柳青月",
    "张言泽",
    "村长",
    "柳青月",
    "村长",
    "柳青月",
    "村长",
    "村长",
    "柳青月",
    "",
    "柳青月",
    "张言泽",
    "张言泽",
    "柳青月",
    "柳青月",
    "柳青月",
    "张言泽",
    "柳青月",
    "张言泽",
    "柳青月",
    "张言泽",
    "柳青月",
    "",
    "",
    "张言泽",
    "柳青月",
    "柳青月",
    ""];


function nextText() {
    if (l < 58) {
        k++;
        i = 0;
    }
    else {
        return;
    }
    typingEffect();
    typingName();
}

function typingEffect() {

    if (i < text[k].length) {
        document.getElementById('duihua').innerHTML += text[k].charAt(i);
        i++;
        setTimeout(typingEffect, 50);


    }

}



function typingName() {
    document.getElementById('mingzi').innerHTML = charName[k];

}


function remove() {
    document.getElementById('duihua').innerHTML = "";
    document.getElementById('mingzi').innerHTML = "";
    nextText();
}

function nextDialogue() {
    addEventListener('click', remove);

}

nextDialogue();