var i = 0, k = -1, l = 0;
let text = ["在张言泽对可能存在的情况进行分析的时候，脚底传来了深沉的一声闷响——这代表着飞船顺利着地了。",
    "在张言泽边走向飞船出口的时候，DX-Ⅱ也在帮助装配上了外骨骼和植入了语言辅助学习系统。",
    "走下飞船后，DX-Ⅱ就驾驶着“工蜂”无声无息地离开了，张言泽打开便携式导航，显示自己与刘雯最后一次发送的信号定位相距不远。",
    "跟着便携式导航一路攀爬，在翻过前面一个不大的小山丘后，便可看到定位的小城的大致轮廓了。",
    "进城后……",
    "看来这个星球的文明很像地球古文明那种，从这里的当地生物的长相来看，似乎与人类并无二样。",
    "张言泽在观察这四周的环境的时候，突然看到了令他震惊的一幕",
    "一位穿着道袍的老仙人竟然手搓出火苗，手指一定，火苗便顺势飞进了隔壁打铁铺里即将熄灭的火炉中，顿时间便又熊熊燃烧起来。",
    "对于张言泽而言，这种仙术能够亲自看到是一件很神奇的事情。",
    "但是对于一个探索者而言，长期穿梭于宇宙的各个尽头，各种奇怪的现象也并不少见，因此也不至于惊慌失措。当前关键任务还是要找到刘雯。",
    "就这么在小城里四处行走了一天，天色渐黑，然而还是没有找到有关刘雯的痕迹。",
    "看来这样毫无目的地寻找的意义不大，刘雯会失联，说明她可能遭受了一些危险，说不定可能会受伤。",
    "假如她离开飞船选择隐藏，那么相应的最为基础的食物等也会随之欠缺。那么明天我可以去熟食店、药馆等地方打听打听……",
    "第二天，发现外面下起了淅沥的小雨。",
    "外面的行人明显比昨日少了许多，这有利于我去打听消息。首先先去把小城里的售卖食物的地方先问问吧。",
    "一个上午过去，卖食物的商家都表示不曾看到过。",
    "看来想要通过食物来源找到刘雯是不太现实了。",
    "再去这附近类似于医院的药馆找找看吧，希望下午不要让我失望。",
    "边想边走着，突然路边的一个吆喝着卖瓜的老板吸引了张言泽的注意……"];

let charName = ["",
    "",
    "",
    "",
    "",
    "张言泽",
    "",
    "",
    "",
    "",
    "",
    "张言泽",
    "张言泽",
    "",
    "张言泽",
    "",
    "张言泽",
    "张言泽",
    ""];


function nextText() {
    if (l < 19) {
        k++;
        i = 0;
    }
    else {
        return;
    }
    typingEffect();
    typingName();
}

function typingEffect() {

    if (i < text[k].length) {
        document.getElementById('duihua').innerHTML += text[k].charAt(i);
        i++;
        setTimeout(typingEffect, 50);


    }

}



function typingName() {
    document.getElementById('mingzi').innerHTML = charName[k];

}


function remove() {
    document.getElementById('duihua').innerHTML = "";
    document.getElementById('mingzi').innerHTML = "";
    nextText();
}

function nextDialogue() {
    addEventListener('click', remove);
  
}

nextDialogue();